init.org
#+TITLE: Emacs Configuration
#+AUTHOR: Nguyễn Đức Hiếu
#+STARTUP: content
#+OPTIONS: num:3 ^:nil toc:nil
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[utf8]{vietnam}

* Information
  
The whole thing is driven by the following =.emacs=

#+begin_example emacs-lisp
  ;; init.el for this setup. Must use Emacs 24
  (org-babel-load-file
  (expand-file-name "init.org"
                   "/media/Logical_Drive/Emacs/Settings"))
		   
#+end_example

* General
General config for emacs with no major mode involved
** Path configurations

#+BEGIN_SRC emacs-lisp

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/"))
  (add-to-list 'package-archives '("elpy" . "https://jorgenschaefer.github.io/packages/"))
  (package-initialize)

  ;; Requice common-lisp library
  (require 'cl-lib)
  (require 'bind-key)
#+END_SRC

** Appearence
   
#+BEGIN_SRC emacs-lisp

  ;; Initialize Emacs full screen 
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))

  ;; No startup messages on *scratch* buffer
  (setq initial-scratch-message "")

  ;; Cursor type
  (setq-default cursor-type 'bar)


  ;; Default font
  (require 'unicode-fonts)
  (unicode-fonts-setup)
  (set-frame-font "DejaVu Sans Mono 10" nil t)


  ;; Set themes
  (load-theme 'gruvbox t)
  (set-face-attribute 'font-lock-comment-face nil :foreground "#27ae60")
  (set-face-attribute 'default nil :foreground "#ffffff")
  (set-face-attribute 'mode-line nil :background "#2f4f4f" :foreground "#ffffff")

  ;; Set background face for color string
  (add-hook 'prog-mode-hook 'rainbow-mode)


  ;; Global font-lock mode
  (setq global-font-lock-mode t)


  ;; Enable line number and column number
  (setq column-number-mode t)

  ;; Disable tool bar, menu bar, and scroll bar
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (menu-bar-mode 1)

  ;; Paren mode
  (show-paren-mode t)
  (setq show-paren-delay 0)


#+END_SRC

** Editing
Viết một chữ gì đấy bằng tiếng việt thì hay hơn
#+BEGIN_SRC emacs-lisp

  ;; Delete marked region when input
  (delete-selection-mode 1)

  ;; Global mark ring
  (setq global-mark-ring-max 50000)

  ;; "Yes or no"? Too much writing
  (defalias 'yes-or-no-p 'y-or-n-p)


  ;; Auto close bracket insertion.
  (electric-pair-mode 1)
  (setq electric-pair-pairs '(
			      (?\" . ?\")
			      (?\( . ?\))
			      (?\{ . ?\})
			      ) )

  (when (fboundp 'electric-indent-mode) (electric-indent-mode -1))


  ;; Set kill ring size
  (setq global-mark-ring-max 50000)
  
  ;; Bound undo to C-z
  (global-set-key (kbd "C-z") 'undo)

  ;; Expand region with M-m
  (require 'expand-region)
  (global-set-key (kbd "C-'") 'er/expand-region)

  ;; Multi-cursor
  (require 'multiple-cursors)
  (global-set-key (kbd "C-?") 'mc/edit-lines)
  (global-set-key (kbd "C->") 'mc/mark-next-like-this)
  (global-set-key (kbd "C-<") 'mc/mark-previous-like-this)
  (global-set-key (kbd "C-c C-<") 'mc/mark-all-like-this)
  (global-set-key (kbd "C-N") 'mc/insert-numbers)

  ;; Define function: fill character to 80
  (defun fill-to-end (char)
    (interactive "cFill Character:")
    (save-excursion
      (end-of-line)
      (while (< (current-column) 80)
	(insert-char char))))

  ;; Eval and replace lisp expression
  (defun fc-eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (prin1 (eval (read (current-kill 0)))
  (current-buffer)))
  (global-set-key (kbd "C-c e") 'fc-eval-and-replace)

#+END_SRC

** Company
Company is a completion mechanism that is very flexible

#+BEGIN_SRC emacs-lisp
  ;; Code completion
  (require 'company)
  (require 'company-files)
  (add-hook 'after-init-hook 'global-company-mode)

  (setq company-selection-wrap-around t
	company-tooltip-align-annotations t
	company-idle-delay 0.36
	company-minimum-prefix-length 2
	company-tooltip-limit 10)
	
  ;; Quick help show up in a popup
  (company-quickhelp-mode 1)
  (setq company-quickhelp-delay 0.2)

#+END_SRC

** Miscelanous
#+BEGIN_SRC emacs-lisp
  ;; Auto-revert mode
  (global-auto-revert-mode 1)
  (setq auto-revert-interval 0.5)




  ;; Backup stored in /tmp
  (setq backup-directory-alist
	`((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
	`((".*" ,temporary-file-directory t)))

  ;; Delete old backup
  (message "Deleting old backup files...")
  (let ((week (* 60 60 24 7))
	(current (float-time (current-time))))
    (dolist (file (directory-files temporary-file-directory t))
      (when (and (backup-file-name-p file)
		 (> (- current (float-time (fifth (file-attributes file))))
		    week))
	(message "%s" file)
	(delete-file file))))




  ;; Startup
  (add-hook 'after-init-hook 
    (lambda () 
    (find-file (format "%s/%s" config-directory "init.org"))))
  
#+END_SRC

** Yasnippets

#+BEGIN_SRC emacs-lisp

  ;; Enable Yasnippets
  (require 'yasnippet)
  (yas-global-mode 1)
  
  (setq yas-snippet-dirs (format "%s/%s" config-directory "Snippets"))
#+END_SRC

** Helm
#+BEGIN_SRC emacs-lisp

  (require 'helm)
  (require 'helm-config)

  ;; The default "C-x c" is quite close to "C-x C-c", which quits Emacs.
  ;; Changed to "C-c h". Note: We must set "C-c h" globally, because we
  ;; cannot change `helm-command-prefix-key' once `helm-config' is loaded.
  (bind-key* (kbd "C-c h") 'helm-command-prefix)
  (global-unset-key (kbd "C-x c"))

  (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
  (define-key helm-map (kbd "C-i") 'helm-execute-persistent-action)   ; make TAB work in terminal
  (define-key helm-map (kbd "C-z")  'helm-select-action)              ; list actions using C-z

  (when (executable-find "curl")
  (setq helm-google-suggest-use-curl-p t))

  (setq 
  helm-split-window-in-side-p           t ; open helm buffer inside current window, not occupy whole other window
  helm-move-to-line-cycle-in-source     t ; move to end or beginning of source when reaching top or bottom of source.
  helm-ff-search-library-in-sexp        t ; search for library in `require' and `declare-function' sexp.
  helm-scroll-amount                    8 ; scroll 8 lines other window using M-<next>/M-<prior>
  helm-ff-file-name-history-use-recentf t
  helm-echo-input-in-header-line        t)


  (setq helm-autoresize-max-height 0)
  (setq helm-autoresize-min-height 30)
  (helm-autoresize-mode 1)

  (helm-mode 1)

  ;; Use helm for some common task
  (global-set-key (kbd "C-x b") 'helm-buffers-list)
  (global-set-key (kbd "M-x") 'helm-M-x)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
  (setq helm-M-x-fuzzy-match t)


  ;; Use "C-:" to switch to Helm interface during companying
  (require 'helm-company)
  (eval-after-load 'company
  '(progn
  (define-key company-mode-map (kbd "C-:") 'helm-company)
  (define-key company-active-map (kbd "C-:") 'helm-company))) 
     

#+END_SRC

** Polymode

#+BEGIN_SRC emacs-lisp

  (require 'polymode)
  (require 'poly-R)
  (require 'poly-markdown)
  (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.Snw$" . poly-noweb+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rnw$" . poly-noweb+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rmd$" . poly-markdown+r-mode))
  ;; (add-to-list 'auto-mode-alist '("\\.Rmd$" . poly-markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.rapport$" . poly-rapport-mode))
  (add-to-list 'auto-mode-alist '("\\.Rhtml$" . poly-html+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rbrew$" . poly-brew+r-mode))
  (add-to-list 'auto-mode-alist '("\\.Rcpp$" . poly-r+c++-mode))
  (add-to-list 'auto-mode-alist '("\\.cppR$" . poly-c++r-mode))

#+END_SRC

