init.org
* Org-mode
#+BEGIN_SRC emacs-lisp

  ;; Enable shift selection
  (setq org-support-shift-select t)


  ;; fontify code in code blocks
  (setq org-src-fontify-natively t)
  (set-face-attribute 'org-block nil :foreground "#ffffff")
  (set-face-attribute 'org-block-begin-line nil :foreground "#d5c4a1")
  (set-face-attribute 'org-block-end-line nil :foreground "#d5c4a1")

#+END_SRC
* Terminal
#+BEGIN_SRC emacs-lisp
  ;; Keybinding for terminal
  (global-set-key [f2] 'shell)

  ;; Use ubuntu font
  (add-hook 'shell-mode-hook (lambda ()   
     (setq buffer-face-mode-face '(:family "Ubuntu"))
			    (buffer-face-mode)))

#+END_SRC
* =ESS= for =R= programming
** Setting up
#+BEGIN_SRC emacs-lisp

  (require 'ess-site)
  (require 'ess-rutils)

  (add-hook 'inferior-ess-mode-hook (lambda () (font-lock-mode 0)) t)

  ;; Indentation style
  (setq ess-default-style 'RStudio)

  ;; Describe object
  (setq ess-R-describe-object-at-point-commands
      '(("str(%s)")
       ("print(%s)")
       ("summary(%s, maxsum = 20)")))

#+END_SRC

** Code completion
#+BEGIN_SRC emacs-lisp
  (setq ess-use-company 'script-only)
  (setq ess-tab-complete-in-script t)	;Press <tab> inside functions for completions

  ;; Show quickhelp
  (define-key company-active-map (kbd "C-;") 'company-show-doc-buffer)

  ;; Others
  (setq company-selection-wrap-around t
  company-tooltip-align-annotations t
  company-idle-delay 0.36
  company-minimum-prefix-length 2
  company-tooltip-limit 10)

  ;; Eldoc mode for function arguments hints
  (require 'ess-eldoc)

#+END_SRC

** Functions and key bindind
#+BEGIN_SRC emacs-lisp
  ;; Returm C-c h as prefix to Helm"
  (defun ess-map-control-h-to-helm ()
     "Return C-c h to helm prefix instead of ess-handy-commands"
     (interactive)
     (local-unset-key (kbd "C-c h"))
     (local-set-key (kbd "C-c h") 'helm-command-prefix))

  (add-hook 'ess-mode-hook 'ess-map-control-h-to-helm)

  ;; Remap "<-" key to M-- instead of smart bind to "_"
  (ess-toggle-underscore nil)
  (define-key ess-mode-map (kbd "M--") 'ess-smart-S-assign)
  (define-key inferior-ess-mode-map (kbd "M--") 'ess-smart-S-assign)

  ;; Hot key C-S-m for pipe operator in ESS
  (defun then_R_operator ()
    "R - %>% operator or 'then' pipe operator"
    (interactive)
    (just-one-space 1)
    (insert "%>%")
    (just-one-space 1))
  (define-key ess-mode-map (kbd "C-S-m") 'then_R_operator)
  (define-key inferior-ess-mode-map (kbd "C-S-m") 'then_R_operator)

  ;; Truncate long lines
  (add-hook 'special-mode-hook (lambda () (setq truncate-lines t)))
  (add-hook 'inferior-ess-mode-hook (lambda () (setq truncate-lines t)))


  (defun ess-rmarkdown ()
  "Compile R markdown (.Rmd). Should work for any output type."
  (interactive)
  ;; Check if attached R-session
  (condition-case nil
      (ess-get-process)
    (error
     (ess-switch-process)))
  (let* ((rmd-buf (current-buffer)))
    (save-excursion
      (let* ((sprocess (ess-get-process ess-current-process-name))
	     (sbuffer (process-buffer sprocess))
	     (buf-coding (symbol-name buffer-file-coding-system))
	     (R-cmd
	      (format "library(rmarkdown); rmarkdown::render(\"%s\")"
		      buffer-file-name)))
	(message "Running rmarkdown on %s" buffer-file-name)
	(ess-execute R-cmd 'buffer nil nil)
	(switch-to-buffer rmd-buf)
	(ess-show-buffer (buffer-name sbuffer) nil)))))

  (define-key polymode-mode-map "\M-ns" 'ess-rmarkdown)

  (defun ess-rshiny ()
    "Compile R markdown (.Rmd). Should work for any output type."
    (interactive)
    ;; Check if attached R-session
    (condition-case nil
	(ess-get-process)
      (error
       (ess-switch-process)))
    (let* ((rmd-buf (current-buffer)))
      (save-excursion
	(let* ((sprocess (ess-get-process ess-current-process-name))
	       (sbuffer (process-buffer sprocess))
	       (buf-coding (symbol-name buffer-file-coding-system))
	       (R-cmd
		(format "library(rmarkdown);rmarkdown::run(\"%s\")"
			buffer-file-name)))
	  (message "Running shiny on %s" buffer-file-name)
	  (ess-execute R-cmd 'buffer nil nil)
	  (switch-to-buffer rmd-buf)
	  (ess-show-buffer (buffer-name sbuffer) nil)))))

  (define-key polymode-mode-map "\M-nr" 'ess-rshiny)

#+END_SRC

* =Elpy= for =python= programming

#+BEGIN_SRC emacs-lisp
  (elpy-enable)				
  (with-eval-after-load 'elpy (flymake-mode -1))
  (setq elpy-rpc-python-command "python3")
  (setq python-shell-interpreter "python3")

  ;; ipython
  (elpy-use-ipython "python3")

  ;; Enable company
  (add-hook 'python-mode-hook 'company-mode)
  (add-hook 'inferior-python-mode-hook 'company-mode)

  ;; Keybinding
  (define-key python-mode-map (kbd "C-c C-c") 'elpy-shell-send-current-statement)
  (define-key python-mode-map (kbd "C-c <RET>") 'elpy-shell-send-region-or-buffer)

  ;; Ill put flycheck configurations here temporary
  ;; (with-eval-after-load 'flycheck
  ;; (flycheck-pos-tip-mode))

  ;; (defun flymake-to-flycheck ()
  ;;    "Change from flymake to flycheck when flymake is on."
  ;;    (interactive)
  ;;    (flymake-mode-off)
  ;;    (flycheck-mode 1))

  ;; (add-hook 'python-mode-hook 'flymake-to-flycheck)

#+END_SRC

* =AUCTeX= for \LaTeX{} programming
#+BEGIN_SRC emacs-lisp
  (load "auctex.el" nil t t)

  ;; Appearance
  (require 'font-latex)
  (set-face-attribute 'font-latex-math-face nil :foreground "#ffffff")

  (setq TeX-auto-save t)			    
  (setq TeX-parse-self t)
  ;; Enable query for master file
  (setq-default TeX-master nil)		    
  (setq TeX-save-query nil)		    
  (setq TeX-PDF-mode t)			    
  (setq font-latex-fontify-sectioning 'color) 
  (setq font-latex-fontify-script nil)	    

  ;; Word-wrap
  (add-hook 'TeX-mode-hook (lambda () (setq-default word-wrap t)))

  ;; Completion
  (require 'company-auctex)
  (company-auctex-init)

#+END_SRC

* Web Developments
#+BEGIN_SRC emacs-lisp
  ;; Rainbow mode
  (add-hook 'html-mode-hook 'rainbow-mode)
  (add-hook 'css-mode-hook 'rainbow-mode)
#+END_SRC

* Pdf-tools 

#+BEGIN_SRC emacs-lisp
  
  (pdf-tools-install)
  (setq pdf-view-display-size "fit-page")
  (setq auto-revert-interval 0)
  (setq ess-pdf-viewer-pref "emacsclient")
  (setq TeX-view-program-selection '((output-pdf "PDF Tools")))

  (setq pdf-view-midnight-colors '("#fffff8" . "#111111"))
#+END_SRC

* Magit

#+BEGIN_SRC emacs-lisp

  ;; Currently magit cause some error when auto revert mode is on
  (setq magit-auto-revert-mode nil)

#+END_SRC

