init.tex

\section{Draft}
\label{sec:org4a654b2}
Settings in this section are not yet organized but are being used

\begin{verbatim}

  ;; Add ess command to always run in multiple cursor mode
  (setq ess-cmds-run-all-mc '(ess-smart-comma then_R_operator ess-smart-S-assign))
  (setq mc/cmds-to-run-once 
    (set-difference mc/cmds-to-run-once ess-cmds-run-all-mc))
  (setq mc/cmds-to-run-for-all 
    (union mc/cmds-to-run-for-all ess-cmds-run-all-mc))


  ;; Email settings
  (setq user-full-name "Nguyễn Đức Hiếu"
	user-mail-address "hieunguyen31371@gmail.com")

  ;; ess syntax highlight

(add-hook 'ess-mode-hook
      '(lambda()
	 (font-lock-add-keywords
	  nil
	  '(

	("\\<\\(if\\|for\\|function\\|return\\|$\\|@\\)\\>[\n[:blank:]]*(" 1
	 font-lock-keyword-face) ; must go first to override highlighting below

	("\\<\\([.A-Za-z][._A-Za-z0-9]*\\)[\n[:blank:]]*(" 1
	 font-lock-function-name-face) ; highlight function names

	("\\([(,]\\|[\n[:blank:]]*\\)\\([.A-Za-z][._A-Za-z0-9]*\\)[\n[:blank:]]*=[^=]"
	 2 font-lock-reference-face)

	;; highlight operators
	("\\(\\$\\|\\@\\|\\!\\|\\%\\|\\^\\|\\&\\|\\*\\|\(\\|\)\\|\{\\|\}\\|\\[\\|\\]\\|\\-\\|\\+\\|\=\\|\\/\\|\<\\|\>\\|:\\)" 1 font-lock-builtin-face)

	;; highlight S4 methods
	("\\(setMethod\\|setGeneric\\|setGroupGeneric\\|setClass\\|setRefClass\\|setReplaceMethod\\)" 1 font-lock-reference-face)

	;; highlight packages called through ::, :::
	("\\(\\w+\\):\\{2,3\\}" 1 font-lock-constant-face)

	;; highlight named arguments -- this was found on an earlier mailing list post
	("\\([(,]\\|[\n[:blank:]]*\\)\\([.A-Za-z][._A-Za-z0-9]*\\)[\n[:blank:]]*=[^=]"
	2 font-lock-reference-face)

	;; highlight packages called through ::, :::
	("\\(\\w+\\):\\{2,3\\}" 1 font-lock-constant-face)

	;; highlight S4 methods
	("\\(setMethod\\|setGeneric\\|setGroupGeneric\\|setClass\\|setRefClass\\|setReplaceMethod\\)" 1 font-lock-reference-face)

	))
	 ))

\end{verbatim}

\section{{\bfseries\sffamily TODO} }
\label{sec:org88b2556}
\subsection{Add special face to latex default font}
\label{sec:org6c80e8c}

\begin{verbatim}
regex for everything
((.|\n)*)
"\\(.\\|\\\n\\)*"

regex for special command:
(\\\w+(\*|)|\{(|.+?)\}|\[(|.+?)\]|[^\\]%(.+|)|<<(.|\n)*?@)
"\\(\\\\\\([A-Za-z]*\\)\\|{\\(.\\|\\\n\\)*?}\\|\\[\\(.\\|\\\n\\)*?\\]\\|<<\\(.\\|\\\n\\)*?@\\)"

\end{verbatim}
\subsection{Add special font to all TODO keywords in all modes}
\label{sec:org5646bf8}
Through something like:

\begin{verbatim}

(add-hook 'tex-mode-hook
  (lambda ()
   (font-lock-add-keywords nil
    '(("\\<\\(FIXME\\):" 1 'font-lock-warning-face prepend)
      ("\\<\\(and\\|or\\|not\\)\\>" .
       'font-lock-keyword-face)))))


\end{verbatim}
\end{document}